## Ответ на Задачу No 232: The Expected Number of Tosses

### 1. Анализ задачи и решение
**Понимание задачи:**

*   Два игрока, A и B, бросают монеты. Игрок A бросает монету `a` раз, игрок B бросает `b` раз.
*   Игрок выигрывает, если хотя бы один из его бросков выпал орлом.
*   Нужно найти ожидаемое количество бросков (сумма бросков A и B) до тех пор, пока кто-то не выиграет.
*   Обозначим вероятность выигрыша игрока A как P(A), а игрока B как P(B).

**Решение:**

1.  **Вероятность выигрыша игрока A:**
    *   Вероятность того, что игрок A не выигрывает ни разу за `a` бросков равна (1/2)^`a`.
    *   Следовательно, вероятность выигрыша игрока A P(A) = 1 - (1/2)^`a`.
2.  **Вероятность выигрыша игрока B:**
    *   Аналогично, вероятность того, что игрок B не выигрывает ни разу за `b` бросков равна (1/2)^`b`.
    *   Следовательно, вероятность выигрыша игрока B P(B) = 1 - (1/2)^`b`.
3.  **Вероятность выигрыша хотя бы одного из игроков:**
    *   Вероятность того, что оба игрока не выиграют, равна (1/2)^`a` * (1/2)^`b`.
    *   Вероятность того, что хотя бы один из игроков выиграет, равна 1 - (1/2)^`a` * (1/2)^`b` = 1 - (1/2)^(`a`+`b`).
4.  **Ожидаемое число бросков:**
    *   Пусть X - количество раундов до первого выигрыша.
    *   X является случайной величиной, подчиняющейся геометрическому распределению.
    *   Вероятность успеха в одном раунде (т.е., выигрыша хотя бы одним из игроков) равна  p = 1 - (1/2)^(`a`+`b`).
    *   Ожидание геометрического распределения равно E(X) = 1/p.
    *   В каждом раунде делается a + b бросков.
    *   Следовательно, ожидаемое число бросков E(a,b) = (a + b) * E(X) = (a + b) / (1 - (1/2)^(`a`+`b`)).

### 2. Алгоритм решения
1. Начать
2. Ввести значения a и b
3. Вычислить вероятность выигрыша хотя бы одного из игроков:
   * `win_probability` = 1 - (0.5)^(`a` + `b`)
4. Вычислить ожидаемое количество бросков:
   * `expected_tosses` = (`a` + `b`) / `win_probability`
5. Вывести `expected_tosses`
6. Конец

### 3. Реализация на Python 3.12
```python
def expected_tosses(a, b):
  """
  Calculates the expected number of tosses until one player wins.

  Args:
      a: The number of tosses player A makes.
      b: The number of tosses player B makes.

  Returns:
      The expected number of tosses.
  """
  win_probability = 1 - (0.5)**(a + b)
  expected_tosses_count = (a + b) / win_probability
  return expected_tosses_count


# Пример использования:
a = 10
b = 1000
result = expected_tosses(a, b)
print(f"{result:.6f}")
```

### 4. Блок-схема в формате mermaid
```mermaid
flowchart TD
    Start((Начало)) --> InputValues((Ввести a, b))
    InputValues --> CalculateWinProbability((Вычислить win_probability = 1 - (0.5)^(a+b)))
    CalculateWinProbability --> CalculateExpectedTosses((Вычислить expected_tosses = (a+b) / win_probability))
    CalculateExpectedTosses --> OutputResult((Вывести expected_tosses))
    OutputResult --> End((Конец))
```

**Legenda:**
* **Start, End:** Начало и конец алгоритма.
* **InputValues:** Ввод значений `a` и `b` (количество бросков для каждого игрока).
* **CalculateWinProbability:** Вычисление вероятности выигрыша хотя бы одного из игроков.
* **CalculateExpectedTosses:** Вычисление ожидаемого количества бросков.
* **OutputResult:** Вывод результата (ожидаемого количества бросков).
