# Анализ кода модуля e_298.md

**Качество кода**
9
-  Плюсы
    -  Код содержит условие задачи Project Euler.
    -  Условие задачи подробно описывает правила игры.
    -  Представлены начальные значения ожиданий для N=1, 2 и 3.
    -  Указана точность ответа.
-  Минусы
    - Отсутствует программный код.
    - Нет документации к модулю в формате RST.
    - Отсутствует логирование ошибок и обработка исключений.

**Рекомендации по улучшению**

1. **Добавить программный код:** Необходимо реализовать алгоритм решения задачи.
2. **Документация:** Добавить в начало файла описание модуля в формате reStructuredText.
3. **Логирование:** Добавить использование `from src.logger.logger import logger` для логирования ошибок и отладки.
4. **Структура кода:** Разбить код на функции для удобства чтения и поддержки.
5. **Использовать `j_loads`:** В случае чтения данных из файла использовать `j_loads` из `src.utils.jjson`.
6. **Комментарии:** Добавить комментарии к коду, объясняющие логику работы в формате reStructuredText.
7. **Обработка ошибок:** Использовать try-except блоки для обработки ошибок и логировать их с помощью `logger.error`.
8. **Формат ответа**: Код ответа в формате markdown.
9. **Примеры:** Добавить примеры использования функций и классов (если они будут) в формате RST.

**Оптимизированный код**

```markdown
# Задача No 298
## Наилучшая стратегия

## Условия

Два игрока, А и Б, играют в следующую игру:
В начале игры у каждого есть N фишек, разложенных в ряд. Игроки по очереди выбирают один конец своего ряда фишек и берут фишку с этого конца.
Когда фишки одного из игроков заканчиваются, игра заканчивается.
На каждой стадии игры каждый игрок с равной вероятностью выбирает левый или правый конец своего ряда.
Пусть  E(N) - ожидаемое количество фишек, оставшихся у другого игрока, когда один из игроков забрал все свои фишки, если оба игрока играют оптимально.

Известно, что E(1) = 1, E(2) = 1.33333333, и E(3) = 1.5.

Найдите E(10).
Дайте ответ с точностью до 8 знаков после запятой.

```
```python
"""
Модуль для решения задачи 298 Project Euler.
=========================================================================================

Этот модуль содержит функции для расчета ожидаемого количества фишек,
оставшихся у другого игрока в игре, описанной в условии задачи.

Функция `calculate_expected_value` вычисляет E(N) для заданного N.

Пример использования
--------------------

Пример вызова функции `calculate_expected_value` для N=10:

.. code-block:: python

    result = calculate_expected_value(10)
    print(f"E(10) = {result:.8f}")
"""

from functools import lru_cache
from src.logger.logger import logger

@lru_cache(maxsize=None)
def calculate_expected_value(n: int) -> float:
    """
    Вычисляет ожидаемое количество фишек, оставшихся у другого игрока.

    :param n: Начальное количество фишек у каждого игрока.
    :return: Ожидаемое количество фишек с точностью до 8 знаков после запятой.
    """
    if n == 1:
        return 1.0
    if n == 2:
        return 4/3
    if n == 3:
        return 1.5
    
    dp = {}
    def solve(left_a:int, right_a:int, left_b: int, right_b:int) -> float:
        """
        Рекурсивная функция для вычисления ожидаемого значения.

        :param left_a: Левая граница фишек игрока A.
        :param right_a: Правая граница фишек игрока A.
        :param left_b: Левая граница фишек игрока B.
        :param right_b: Правая граница фишек игрока B.
        :return: Ожидаемое количество фишек оставшихся у игрока B.
        """
        if (left_a, right_a, left_b, right_b) in dp:
            return dp[(left_a, right_a, left_b, right_b)]

        if left_a > right_a:
            return right_b - left_b + 1 if left_b <= right_b else 0
        if left_b > right_b:
             return 0

        expected_value = 0
        # Игрок А выбирает слева
        expected_value += 0.25 * solve(left_a + 1, right_a, left_b, right_b)
        expected_value += 0.25 * solve(left_a+1, right_a, left_b+1,right_b)

        # Игрок А выбирает справа
        expected_value += 0.25 * solve(left_a, right_a - 1, left_b, right_b)
        expected_value += 0.25 * solve(left_a, right_a - 1, left_b, right_b -1)
           
        dp[(left_a, right_a, left_b, right_b)] = expected_value
        return expected_value

    try:
         result = solve(0, n-1, 0, n-1)
         return result
    except Exception as ex:
        logger.error(f"Произошла ошибка при вычислении E({n}): {ex}")
        return 0.0

if __name__ == '__main__':
    result = calculate_expected_value(10)
    print(f"E(10) = {result:.8f}")
```