# ИНСТРУКЦИЯ ПО ОБРАБОТКЕ КОМПОНЕНТОВ СБОРКИ КОМПЬЮТЕРА

## Обзор

Данная инструкция описывает процесс анализа JSON-данных, содержащих информацию о компонентах компьютера, для классификации типа сборки (например, игровой или рабочая станция) и генерации описания на русском языке.  Входные данные представлены на иврите и требуют перевода.  Выходной ответ должен быть валидным JSON в соответствии с предоставленным шаблоном.

## Функции

### `process_computer_components`

**Описание**: Функция обрабатывает входные JSON-данные, содержащие информацию о компонентах компьютера, и возвращает структурированный JSON-ответ в соответствии с заданным шаблоном.

**Параметры**:

- `input_data` (dict): JSON-словарь с информацией о компонентах компьютера (на иврите).

**Возвращает**:

- `dict`: Структурированный JSON-ответ в соответствии с шаблоном (на русском языке).

**Вызывает исключения**:

- `ValueError`: Если входные данные не соответствуют ожидаемому формату или содержат необрабатываемые ошибки.
- `Exception`: Для других непредвиденных ошибок.


##  Шаблон ответа

### Описание шаблона ответа

Шаблон ответа представлен в формате JSON и содержит следующие ключевые поля:

- `ru`: Объект, содержащий данные на русском языке.
- `title`: Название сборки компьютера на русском языке.
- `description`: Краткое описание сборки на русском языке.
- `build_types`: Словарь, содержащий оценки уверенности в типе сборки (игровой/рабочая станция).
- `products`: Массив объектов, содержащих информацию о каждом компоненте.

```json
{
  "ru": {
    "title": "Высокопроизводительный игровой компьютер",
    "description": "Современный компьютер для требовательных игр и приложений. Включает Intel i7-14700F, Gigabyte RTX 4070, DDR4 RAM 16GB и SSD Kingston 4TB.",
    "build_types": {
      "gaming": 0.9,
      "workstation": 0.1
    },
    "products": [
      {
        "product_id": "<оставить как есть из входных данных>",
        "product_title": "<название продукта на русском>",
        "product_description": "<описание продукта на русском>",
        "specification": "<спецификация продукта на русском>",
        "image_local_saved_path": "<оставить как есть из входных данных>"
      },
      <other components from input data>
    ]
  }
}
```

**Обратите внимание**:  Внутри массива `products` необходимо заполнить поля `product_title`, `product_description` и `specification` на основе переведённой информации из входных данных.  Поля `product_id` и `image_local_saved_path` должны быть скопированы из входных данных без изменений.  Если какая-то информация не может быть извлечена или обработана, соответствующие поля в объектах `products` оставляются пустыми.

##  Обработка исключений

Функция `process_computer_components` должна содержать обработку возможных исключений (`ValueError`, `Exception`) для обеспечения стабильной работы и предотвращения аварийных завершений программы.
```python
# ... (код функции)
ex_handling = [
    ValueError,
    Exception,
    # ... другие возможные исключения
]


try:
    # ... (код обрабатывающий входные данные)
ex_catch = []
for ex in ex_handling:
  try:
        # ... (код обрабатывающий входные данные)
  except ex as e:
      ex_catch.append(e)

# Обработка исключений
if len(ex_catch) > 0:
    print(ex_catch)
    # ... (обработка ошибки)
    return None # или другое значение по умолчанию

```