# Анализ кода модуля `digits.py`

**Качество кода**
9
-  Плюсы
    - Код хорошо структурирован, разбит на функции, что делает его читаемым и легким для понимания.
    - Используются содержательные имена переменных и функций.
    - Есть подробные docstring для функций, объясняющие их назначение.
    - Реализована логика игры "ACE" в соответствии с описанием.
    - Код обрабатывает ввод пользователя, проверяя его на корректность.
    - Присутствуют подробные комментарии, объясняющие назначение каждой части кода.
    - Добавлена блок-схема в формате mermaid.
    - Присутсвует подробное описание алгоритма работы программы
-  Минусы
    - Отсутствует обработка ошибок при вызове функции `random.choice()` если колода пуста.
    - Отсутствует использование `logger` для логирования.
    - Код можно немного оптимизировать, убрав лишние комментарии, которые уже есть в docstring.

**Рекомендации по улучшению**

1. **Использовать `logger` для обработки ошибок**:
    - Заменить стандартный `print` на `logger.error` при выводе сообщений об ошибках.
    - Добавить обработку исключения `IndexError` в функции `draw_card`, которая может возникнуть, если колода карт пуста.
2. **Улучшить документацию**:
   - Привести docstring к формату reStructuredText.
   - Добавить примеры использования функций в docstring.
   - Убрать избыточные комментарии, которые дублируют docstring.
3. **Оптимизация**:
    - Убрать комментарии, которые дублируют docstring.
    -  Добавить проверку пустой колоды в функции `draw_card`.
4. **Форматирование**:
   -   Привести весь код к единому стилю (например, PEP8).

**Оптимизированный код**

```python
"""
Модуль для игры в "ACE"
========================

Игра "ACE" - это карточная игра для двух игроков, где каждый игрок по очереди тянет карты из колоды,
стремясь набрать больше очков. Карты оцениваются следующим образом: туз (A) - 1 очко,
карты от 2 до 10 - по номиналу, валет, дама и король - 10 очков. Цель игры - набрать наибольшее количество очков
за несколько раундов.

Правила игры:
1. Два игрока по очереди тянут карты из колоды.
2. Значения карт: A=1, 2-10 по номиналу, J,Q,K=10.
3. В конце каждого раунда очки игроков сравниваются.
4. Игра состоит из заданного количества раундов.
5. Побеждает игрок, набравший больше всего очков за все раунды.

Пример использования:
--------------------
.. code-block:: python

    play_ace_game()
"""
import random
from src.logger.logger import logger


def calculate_card_value(card: str) -> int:
    """
    Вычисляет числовое значение карты.

    :param card: Строковое представление карты (например, '2', 'J', 'A').
    :return: Числовое значение карты. Туз (A) - 1, валет, дама, король - 10, остальные по номиналу.
    :raises ValueError: Если карта не распознана.

    Примеры:
    --------
    >>> calculate_card_value('A')
    1
    >>> calculate_card_value('K')
    10
    >>> calculate_card_value('5')
    5
    """
    if card in ['J', 'Q', 'K']:
        return 10
    elif card == 'A':
        return 1
    else:
        try:
            return int(card)
        except ValueError:
            logger.error(f"Не удалось определить значение карты: {card}")
            return 0


def draw_card(deck: list) -> tuple[str, int]:
    """
    Выбирает случайную карту из колоды.

    :param deck: Список карт в колоде.
    :return: Кортеж из выбранной карты и её числового значения.
    :raises IndexError: Если колода пуста.

    Примеры:
    --------
    >>> deck = ['2', '3', 'A']
    >>> card, value = draw_card(deck)
    >>> print(f'Карта: {card}, Значение: {value}')
    Карта: 2, Значение: 2
    """
    try:
        card = random.choice(deck)
        return card, calculate_card_value(card)
    except IndexError as e:
         logger.error(f"Колода пуста: {e}")
         return '', 0

def play_ace_game():
    """
    Запускает игру ACE.
    Инициализирует счетчики игроков, создает колоду карт, запрашивает количество раундов у пользователя,
    проводит раунды, сравнивает очки игроков и выводит победителя.
    """
    player1Score = 0  # Инициализация счета игрока 1
    player2Score = 0  # Инициализация счета игрока 2

    # Создание колоды карт
    deck = ['2', '3', '4', '5', '6', '7', '8', '9', '10', 'J', 'Q', 'K', 'A'] * 4

    try:
        numberOfRounds = int(input("Сколько раундов вы хотите сыграть? ")) # Запрос количества раундов у пользователя
        if numberOfRounds <= 0:
            logger.error("Количество раундов должно быть положительным числом.")
            return
    except ValueError:
        logger.error("Пожалуйста, введите целое число для количества раундов.")
        return

    for roundNumber in range(1, numberOfRounds + 1):
        print(f"\nРаунд {roundNumber}:")

        # Игрок 1 вытягивает карту
        card1, card1Value = draw_card(deck)
        print(f"Игрок 1 вытащил {card1} ({card1Value} очков)")
        player1Score += card1Value  # Обновление счета игрока 1

        # Игрок 2 вытягивает карту
        card2, card2Value = draw_card(deck)
        print(f"Игрок 2 вытащил {card2} ({card2Value} очков)")
        player2Score += card2Value  # Обновление счета игрока 2

        # Сравнение очков за раунд
        if card1Value > card2Value:
            print("Игрок 1 выиграл этот раунд")
        elif card2Value > card1Value:
            print("Игрок 2 выиграл этот раунд")
        else:
            print("Ничья в этом раунде")

    # Вывод общего счета
    print(f"\nОбщий счет:")
    print(f"Игрок 1: {player1Score} очков")
    print(f"Игрок 2: {player2Score} очков")

    # Определение победителя игры
    if player1Score > player2Score:
        print("Игрок 1 выиграл игру!")
    elif player2Score > player1Score:
        print("Игрок 2 выиграл игру!")
    else:
        print("Ничья в игре!")


if __name__ == "__main__":
    play_ace_game()
```