"""
GUESS:
=================
Сложность: 3
-----------------
Игра "Угадай число" - это классическая игра, в которой компьютер выбирает случайное число в диапазоне от 1 до 100, а игрок должен угадать это число, получая подсказки "слишком низко" или "слишком высоко" после каждой попытки. 
Игра продолжается до тех пор, пока игрок не угадает число.

Правила игры:
1. Компьютер выбирает случайное целое число от 1 до 100.
2. Игрок вводит свои предположения о загаданном числе.
3. После каждой попытки компьютер сообщает, было ли введенное число слишком низким, слишком высоким или угадано.
4. Игра продолжается до тех пор, пока игрок не угадает загаданное число.
-----------------
Алгоритм:
1. Установить число попыток в 0.
2. Сгенерировать случайное число в диапазоне от 1 до 100.
3. Начать цикл "пока число не угадано":
    3.1 Увеличить число попыток на 1.
    3.2 Запросить у игрока ввод числа.
    3.3 Если введенное число равно загаданному числу, перейти к шагу 4.
    3.4 Если введенное число меньше загаданного числа, вывести сообщение "TOO LOW".
    3.5 Если введенное число больше загаданного числа, вывести сообщение "TOO HIGH".
4. Вывести сообщение "YOU GOT IT IN {число попыток} GUESSES!"
5. Конец игры.
-----------------

"""
import random

# Инициализация счетчика попыток
numberOfGuesses = 0
# Генерируем случайное число от 1 до 100
targetNumber = random.randint(1, 100)

# Основной игровой цикл
while True:
    # Увеличиваем количество попыток
    numberOfGuesses += 1
    # Запрашиваем ввод числа у пользователя
    try:
        userGuess = int(input("Угадай число от 1 до 100: "))
    except ValueError:
        print("Пожалуйста, введите целое число.")
        continue

    # Проверяем, угадано ли число
    if userGuess == targetNumber:
        print(f"ПОЗДРАВЛЯЮ! Вы угадали число за {numberOfGuesses} попыток!")
        break  # Завершаем цикл, если число угадано
    elif userGuess < targetNumber:
        print("Слишком низко")  # Сообщаем, что загаданное число больше
    else:
        print("Слишком высоко")  # Сообщаем, что загаданное число меньше

"""
Объяснение кода:
1.  **Импорт модуля `random`**:
   -  `import random`: Импортирует модуль `random`, который используется для генерации случайного числа.
2.  **Инициализация переменных**:
    -   `numberOfGuesses = 0`: Инициализирует переменную `numberOfGuesses` для подсчета попыток игрока, устанавливая её начальное значение в 0.
    -   `targetNumber = random.randint(1, 100)`: Генерирует случайное целое число в диапазоне от 1 до 100 (включительно) и сохраняет его в переменную `targetNumber`. Это число, которое игрок должен угадать.
3.  **Основной цикл `while True:`**:
    -   `while True:`:  Начинает бесконечный цикл, который будет продолжаться до тех пор, пока игрок не угадает число и не сработает оператор `break`.
    -   `numberOfGuesses += 1`: Увеличивает счетчик попыток на 1 при каждой новой итерации цикла.
    -   **Ввод данных с проверкой на ошибку**:
        -   `try...except ValueError`: Этот блок предназначен для обработки ошибок. Если пользователь введет что-то, что не является целым числом, программа не завершится с ошибкой, а выведет сообщение "Пожалуйста, введите целое число." и перейдет к следующей итерации цикла.
        -   `userGuess = int(input("Угадай число от 1 до 100: "))`: Выводит сообщение с просьбой ввести число и преобразует введенное значение в целое число, сохраняя результат в `userGuess`.
    -   **Условие победы**:
        -   `if userGuess == targetNumber:`: Проверяет, равно ли введенное игроком число загаданному числу.
        -   `print(f"ПОЗДРАВЛЯЮ! Вы угадали число за {numberOfGuesses} попыток!")`: Выводит сообщение о победе, включая количество попыток, которое потребовалось игроку.
        -   `break`: Завершает текущий цикл `while True`, так как игра закончена.
    -  **Подсказки**:
        - `elif userGuess < targetNumber:`: Если введенное число меньше загаданного, то выполняется этот блок.
        - `print("Слишком низко")`: Выводит подсказку, что нужно ввести число больше.
        - `else:`: Если число не равно и не меньше загаданного (значит, оно больше), то выполняется этот блок.
        - `print("Слишком высоко")`: Выводит подсказку, что нужно ввести число меньше.
"""
