"""
HELLO:
=================
Сложность: 1
-----------------
Игра "Привет" - это простая игра, которая просто выводит приветствие на экран.

Правила игры:
1. Игра не имеет правил, она просто отображает приветствие на экране.
-----------------
Алгоритм:
1. Вывести на экран сообщение "HELLO".
-----------------
Блок-схема:
```mermaid
flowchart TD
    Start["Начало"] --> OutputHello["Вывод сообщения: <b>HELLO</b>"]
    OutputHello --> End["Конец"]
```
    
Legenda:
    Start - Начало программы.
    OutputHello - Вывод на экран сообщения "HELLO".
    End - Конец программы.
"""


# Вывод сообщения "HELLO" на экран
print("HELLO")

"""
Объяснение кода:
1.  `print("HELLO")`: Выводит на экран строку "HELLO". Это единственная строка кода в программе, и она выполняет основную задачу игры - вывод приветствия.
"""
