# Анализ кода модуля hockey.py

**Качество кода**
    
-  **Соответствие требованиям к формату кода с 1 до 10**
    -  Преимущества
        - Код достаточно прост и понятен.
        - Присутствует описание алгоритма и блок-схема игры.
        - Есть обработка исключений при вводе данных.
    -  Недостатки
        - Отсутствуют docstring у модуля.
        - Отсутствует логгирование ошибок.
        - Используется прямой вывод в консоль вместо логгирования.
        - Нет импорта нужных модулей.
        - Используется не стандартный json, а j_loads_ns.
        - Проверка ввода дублируется.

**Рекомендации по улучшению**

1. Добавить docstring в формате reStructuredText (RST) для модуля.
2. Использовать `from src.logger.logger import logger` для логирования ошибок и информации, исключить `print` для вывода в консоль.
3. Использовать `j_loads_ns` для загрузки данных (если это необходимо) из `src.utils.jjson`.
4. Избавиться от дублирования проверок ввода, вынести в отдельную функцию.
5. Заменить `try-except` на проверку, если это возможно.

**Улучшенный код**
```python
"""
Модуль для реализации игры в хоккей.
=====================================

Модуль предоставляет простую симуляцию хоккейного матча между двумя игроками,
где каждый игрок выбирает одно из трех действий: бросок, защиту или пас.
Очки начисляются в зависимости от комбинации действий игроков.

Правила игры:
    1. Два игрока по очереди вводят ходы.
    2. Ходы вводятся в виде числовых кодов: 1 - бросок, 2 - защита, 3 - пас.
    3. Правила начисления очков:
        - бросок против защиты: очко защищающемуся.
        - бросок против паса: два очка бросающему.
        - защита против броска: очко защищающемуся.
        - защита против паса: очко защищающемуся.
        - пас против броска: два очка бросающемуся.
        - пас против защиты: очко защищающемуся.
    4. Игра продолжается пока один из игроков не наберет 10 очков.

Пример использования:
--------------------
.. code-block:: python

   # игра начинается при запуске модуля
   ...
"""
__author__ = 'hypo69 (hypo69@davidka.net)'

from src.logger.logger import logger  # импортируем logger
from typing import Optional # импортируем Optional

# Инициализация счетов игроков
player1Score = 0 # Инициализация счета первого игрока
player2Score = 0 # Инициализация счета второго игрока


def get_player_move(player_num: int) -> Optional[int]:
    """
    Запрашивает ввод хода от игрока и проверяет его корректность.

    :param player_num: Номер игрока (1 или 2).
    :return: Введенный ход игрока (1, 2 или 3) или None в случае ошибки.
    """
    while True:
        try:
            move = int(input(f"Ход игрока {player_num} (1-бросок, 2-защита, 3-пас): "))
            if 1 <= move <= 3:
                return move
            else:
                logger.error(f"Неверный ввод! Игрок {player_num} ввел неверное число.") # логируем ошибку
                print("Неверный ввод! Введите число от 1 до 3")
        except ValueError as e:
            logger.error(f"Неверный ввод! Игрок {player_num} ввел не число.", exc_info=True) # логируем ошибку
            print("Неверный ввод! Введите число от 1 до 3")
        
# Основной игровой цикл
while player1Score < 10 and player2Score < 10:
    # Запрос ввода хода у первого игрока
    player1Move = get_player_move(1) # получаем ход первого игрока
    if player1Move is None:
        continue

    # Запрос ввода хода у второго игрока
    player2Move = get_player_move(2) # получаем ход второго игрока
    if player2Move is None:
        continue

    # Проверка и начисление очков в зависимости от ходов
    if player1Move == 1 and player2Move == 2:
        player2Score += 1
    elif player1Move == 1 and player2Move == 3:
        player1Score += 2
    elif player1Move == 2 and player2Move == 1:
        player1Score += 1
    elif player1Move == 2 and player2Move == 3:
        player1Score += 1
    elif player1Move == 3 and player2Move == 1:
        player2Score += 2
    elif player1Move == 3 and player2Move == 2:
        player2Score += 1

    # Вывод текущего счета
    logger.info(f"Счет: Игрок 1 - {player1Score}, Игрок 2 - {player2Score}") # логируем текущий счет
    print(f"Счет: Игрок 1 - {player1Score}, Игрок 2 - {player2Score}") # выводим текущий счет

# Определение победителя и вывод сообщения
if player1Score >= 10:
    logger.info("ПЕРВЫЙ ИГРОК ПОБЕДИЛ") # логируем победу первого игрока
    print("ПЕРВЫЙ ИГРОК ПОБЕДИЛ")
else:
    logger.info("ВТОРОЙ ИГРОК ПОБЕДИЛ") # логируем победу второго игрока
    print("ВТОРОЙ ИГРОК ПОБЕДИЛ")