# Модуль `any`

## Обзор

Модуль `any` предоставляет утилиты для преобразования данных различных типов в словари и другие структуры данных Python. Это полезно для обработки данных, которые могут иметь сложную структуру, включая вложенные списки, множества и объекты.

## Подробней

Модуль содержит функцию `any2dict`, которая рекурсивно преобразует любой тип данных в словарь. Это позволяет унифицировать представление данных для дальнейшей обработки, например, для записи в формат JSON или CSV. Функция обрабатывает различные типы данных, такие как списки, множества, числа, строки, булевы значения и None.

## Функции

### `any2dict`

```python
def any2dict(any_data: Any) -> dict | list | Any | bool:
    """
    Рекурсивно преобразует любой тип данных в словарь.

    Args:
        any_data: Любой тип данных.

    Returns:
        Словарь, представляющий входные данные, список, базовый тип данных или `False`, если преобразование невозможно.
    """
```

**Назначение**: Преобразование данных любого типа в словарь.

**Параметры**:
- `any_data` (Any): Входные данные любого типа, которые необходимо преобразовать.

**Возвращает**:
- `dict | list | Any | bool`: Словарь, представляющий входные данные, список, базовый тип данных или `False`, если преобразование невозможно.

**Как работает функция**:

Функция `any2dict` рекурсивно преобразует входные данные `any_data` в словарь, список или возвращает базовый тип данных, если это возможно.

1.  **Проверка типа данных**: Функция проверяет, является ли входной тип данных одним из базовых (int, float, str, bool, None).
2.  **Обработка объектов и словарей**: Если входные данные являются объектом (имеют атрибут `__dict__`) или словарем, функция итерируется по их элементам.
3.  **Рекурсивное преобразование**: Для каждого ключа и значения вызывается `any2dict` для преобразования в словарь.
4.  **Обработка списков и кортежей**: Если входные данные являются списком или кортежем, функция рекурсивно преобразует каждый элемент списка.
5.  **Обработка множеств**: Если входные данные являются множеством, функция рекурсивно преобразует каждый элемент множества.
6.  **Базовые типы данных**: Если входные данные являются базовым типом данных (int, float, str, bool, None), функция возвращает их без изменений.
7.  **Неподдерживаемые типы данных**: Если тип данных не поддерживается, функция возвращает `False`.

```
A [Проверка базового типа]
│
├── Нет → B [Проверка на наличие __dict__ или dict]
│   │
│   ├── Да (__dict__) → C [Итерация по элементам __dict__]
│   │   │
│   │   └── D [Рекурсивное преобразование key и value]
│   │
│   └── Да (dict) → C [Итерация по элементам dict]
│       │
│       └── D [Рекурсивное преобразование key и value]
│
└── Да → Возврат any_data
```

**Примеры**:

```python
import types

data1 = {
    "name": "John",
    "age": 30,
    "address": {
        "city": "New York",
        "street": "Main St",
        "numbers": [1, 2, 3]
    },
    "phones": ["123-456-7890", "987-654-3210"],
    "skills": {"python", "java", "c++"}
}

print(any2dict(data1))
# Вывод: {'name': 'John', 'age': 30, 'address': {'city': 'New York', 'street': 'Main St', 'numbers': [1, 2, 3]}, 'phones': ['123-456-7890', '987-654-3210'], 'skills': ['python', 'java', 'c++']}

data2 = [1, 2, "three", {"key": "value"}]
print(any2dict(data2))
# Вывод: [1, 2, 'three', {'key': 'value'}]

data3 = 123
print(any2dict(data3))
# Вывод: 123

data4 = "string"
print(any2dict(data4))
# Вывод: string

data5 = None
print(any2dict(data5))
# Вывод: None

class MyClass:
    def __init__(self, x):
        self.x = x

data6 = MyClass(10)
print(any2dict(data6))
# Вывод: {}

# Тестируем SimpleNamespace
data7 = types.SimpleNamespace(a=1, b='hello', c=[1, 2, 3])
print(any2dict(data7))
# Вывод: {'a': 1, 'b': 'hello', 'c': [1, 2, 3]}

data8 = {'a': 1, 'b': types.SimpleNamespace(x=2, y=3)}
print(any2dict(data8))
# Вывод: {'a': 1, 'b': {'x': 2, 'y': 3}}

data9 = [types.SimpleNamespace(x=2), 3, 'str']
print(any2dict(data9))
# Вывод: [{'x': 2}, 3, 'str']

data10 = types.SimpleNamespace(a=1, b=MyClass(3))
print(any2dict(data10))
# Вывод: {'a': 1, 'b': ''}

data11 = {"a": 1, "b": MyClass(10)}
print(any2dict(data11))
# Вывод: {'a': 1, 'b': ''}