# Модуль `src.utils.convertors.any`

## Обзор

Модуль предоставляет утилиты для преобразования данных из различных типов в словари и другие структуры данных Python. Основная цель - рекурсивное преобразование любого типа данных в словарь, что особенно полезно при работе с данными, полученными из разных источников и имеющими разную структуру.

## Подробнее

Этот модуль содержит функцию `any2dict`, которая рекурсивно преобразует входные данные в словарь. Он обрабатывает различные типы данных, такие как списки, множества, числа, строки, булевы значения и None. Если входные данные являются объектом с атрибутами (например, экземпляром класса), функция преобразует атрибуты объекта в словарь. Это упрощает работу с данными, имеющими сложную структуру.

## Функции

### `any2dict`

```python
def any2dict(any_data: Any) -> dict | list | Any | bool:
    """
    Рекурсивно преобразует любой тип данных в словарь.

    Args:
        any_data (Any): Любой тип данных.

    Returns:
        dict | list | Any | bool: Словарь, представляющий входные данные, список, базовый тип данных или `False`, если преобразование невозможно.
    """
```

**Назначение**:
Функция `any2dict` предназначена для рекурсивного преобразования данных любого типа в словарь Python. Это полезно, когда необходимо представить сложные структуры данных в виде словаря для дальнейшей обработки или сериализации.

**Параметры**:
- `any_data` (Any): Входные данные любого типа, которые требуется преобразовать в словарь.

**Возвращает**:
- `dict | list | Any | bool`:
  - Если входные данные являются объектом с атрибутами, функция возвращает словарь, содержащий атрибуты объекта и их значения.
  - Если входные данные являются списком или кортежем, функция возвращает список, содержащий преобразованные элементы.
  - Если входные данные являются множеством, функция возвращает список, содержащий преобразованные элементы множества.
  - Если входные данные относятся к базовым типам данных (int, float, str, bool, None), функция возвращает их без изменений.
  - Если преобразование невозможно, функция возвращает `False`.

**Как работает функция**:

1. **Проверка типа данных**:
   - Функция проверяет, является ли входной параметр `any_data` экземпляром одного из базовых типов (set, list, int, float, str, bool, None). Если да, функция возвращает значение `any_data` без изменений.

2. **Обработка объектов с атрибутами или словарей**:
   - Если `any_data` не является базовым типом, функция проверяет, имеет ли он атрибут `__dict__` (что характерно для объектов) или является ли он экземпляром `dict`.
   - Если `any_data` имеет атрибут `__dict__`, функция присваивает его значение переменной `items_dict`. Если `any_data` является словарем, функция присваивает его переменной `items_dict`.

3. **Рекурсивное преобразование**:
   - Если `items_dict` не является пустым, функция итерируется по его элементам (ключ, значение).
   - Для каждого элемента функция рекурсивно вызывает `any2dict` для преобразования ключа и значения.
   - Преобразованные ключ и значение добавляются в словарь `result_dict`.
   - Если преобразование ключа возвращает `False`, элемент не добавляется в `result_dict`.

4. **Обработка списков и кортежей**:
   - Если `any_data` является списком или кортежем, функция итерируется по его элементам.
   - Для каждого элемента функция рекурсивно вызывает `any2dict` для преобразования элемента.
   - Преобразованные элементы добавляются в список `result_list`.
   - Если преобразование элемента возвращает `False`, в `result_list` добавляется пустая строка.

5. **Обработка множеств**:
   - Если `any_data` является множеством, функция итерируется по его элементам.
   - Для каждого элемента функция рекурсивно вызывает `any2dict` для преобразования элемента.
   - Преобразованные элементы добавляются в список `result_set`.
   - Если преобразование элемента возвращает `False`, в `result_set` добавляется пустая строка.

6. **Возврат результата**:
   - Функция возвращает `result_dict`, `result_list`, `result_set` или `any_data` в зависимости от типа входных данных.
   - Если преобразование невозможно, функция возвращает `False`.

**ASCII Flowchart**:

```
    Начало
    ↓
    Проверка типа any_data (базовый тип?)
    ├── Да → Возврат any_data
    └── Нет
        ↓
        Проверка наличия __dict__ или dict
        ├── Да → items_dict = any_data.__dict__ или any_data
        └── Нет → Возврат False
            ↓
            Итерация по items_dict
            ↓
            Рекурсивное преобразование ключа и значения
            ↓
            Добавление в result_dict (если ключ не False)
            ↓
            Возврат result_dict
```

**Примеры**:

```python
import types

data1 = {
    "name": "John",
    "age": 30,
    "address": {
        "city": "New York",
        "street": "Main St",
        "numbers":[1,2,3]
    },
   "phones": ["123-456-7890", "987-654-3210"],
   "skills": {"python", "java", "c++"}
}

print(any2dict(data1))
# Вывод: {'name': 'John', 'age': 30, 'address': {'city': 'New York', 'street': 'Main St', 'numbers': [1, 2, 3]}, 'phones': ['123-456-7890', '987-654-3210'], 'skills': ['python', 'java', 'c++']}

data2 = [1, 2, "three", {"key": "value"}]
print(any2dict(data2))
# Вывод: [1, 2, 'three', {'key': 'value'}]

data3 = 123
print(any2dict(data3))
# Вывод: 123

data4 = "string"
print(any2dict(data4))
# Вывод: string

data5 = None
print(any2dict(data5))
# Вывод: None

class MyClass:
    def __init__(self, x):
        self.x = x

data6 = MyClass(10)
print(any2dict(data6))
# Вывод: {}

# Тестируем SimpleNamespace
data7 = types.SimpleNamespace(a=1, b='hello', c=[1,2,3])
print(any2dict(data7))
# Вывод: {'a': 1, 'b': 'hello', 'c': [1, 2, 3]}

data8 = {'a':1, 'b': types.SimpleNamespace(x=2, y=3)}
print(any2dict(data8))
# Вывод: {'a': 1, 'b': {'x': 2, 'y': 3}}

data9 = [types.SimpleNamespace(x=2), 3, 'str']
print(any2dict(data9))
# Вывод: [{'x': 2}, 3, 'str']

data10 = types.SimpleNamespace(a=1, b=MyClass(3))
print(any2dict(data10))
# Вывод: {'a': 1, 'b': ''}

data11 = {"a":1, "b": MyClass(10)}
print(any2dict(data11))
# Вывод: {'a': 1, 'b': ''}