# Анализ кода модуля `footbl.py`

**Качество кода**

- **Соответствие требованиям к формату кода (1-10):** 5
   -   **Преимущества:**
        -   Код выполняет основную логику игры "Футбол".
        -   Присутствуют комментарии, описывающие основные шаги игры.
        -   Используется цикл `while` для управления ходом игры.
   -   **Недостатки:**
        -   Отсутствует docstring для модуля.
        -   Комментарии не соответствуют формату reStructuredText (RST).
        -   Не используются `j_loads` или `j_loads_ns` из `src.utils.jjson`.
        -   Не реализована обработка ошибок с помощью `logger.error` из `src.logger.logger`.
        -   Нет docstring для переменных и нет описания алгоритма в формате RST.
        -   Нет импорта необходимых модулей.
        -   Не используется try-except с logger.
        -   Не учтены требования по использованию одинарных кавычек в коде.

**Рекомендации по улучшению**

1.  **Добавить docstring модуля**: Необходимо добавить подробное описание модуля в формате reStructuredText (RST), включая назначение, правила игры и алгоритм.
2.  **Форматировать комментарии**: Все комментарии должны быть переписаны в формате reStructuredText (RST).
3.  **Использовать `logger.error`**: Заменить стандартный вывод ошибок на использование `logger.error` из `src.logger.logger`.
4.  **Добавить обработку ошибок**: Добавить `try-except` блоки с `logger.error` для корректной обработки возможных исключений, например, при вводе нечисловых значений.
5. **Использовать j_loads**: Заменить json.load на j_loads или j_loads_ns при работе с json файлами. В данном коде нет работы с json файлами, но согласно требованиям нужно это отметить.
6. **Одинарные кавычки**:  Необходимо везде использовать одинарные кавычки `'` вместо двойных `"`.
7. **Добавить импорты**: Добавить импорты необходимых модулей, если таковые имеются.
8.  **Улучшить docstring**: Добавить docstring для переменных и подробное описание алгоритма в формате RST.
9.  **Добавить `TODO`**: Добавить `TODO` в комментариях для выделения будущих задач по улучшению.

**Улучшенный код**

```python
"""
Модуль для игры в "Футбол"
=========================================================================================

Модуль реализует простую текстовую игру "Футбол" между двумя игроками.
Игроки по очереди вводят числа, представляющие собой попытки ударов по воротам.
Игра продолжается до тех пор, пока один из игроков не забьет гол.

Правила игры:
1. Два игрока по очереди вводят числа от 1 до 10.
2. Число '1' означает промах, любое другое число - гол.
3. Игра заканчивается, когда один из игроков забивает гол.

Пример использования
--------------------

.. code-block:: python

   import footbl

   footbl.start_game() # TODO: добавить функцию start_game в будущих реализациях

"""
__author__ = 'hypo69 (hypo69@davidka.net)'

from src.logger.logger import logger # импортируем logger #
from typing import Any # импортируем Any

#: int: текущий игрок, начинает игрок 1
currentPlayer: int = 1 # Инициализация текущего игрока (начинает игрок 1)

# Основной игровой цикл
while True:
    # Вывод сообщения о ходе текущего игрока
    print(f'PLAYER {currentPlayer} --- YOUR SHOT') # Вывод сообщения о ходе текущего игрока
    
    # Запрос ввода числа от игрока
    try:
        shot: int = int(input('Введите число от 1 до 10: ')) # Запрос ввода числа от игрока
    except ValueError as e:
        logger.error('Ошибка ввода, введите целое число.', exc_info=True) # Логируем ошибку
        print('Пожалуйста, введите целое число.') # Вывод сообщения об ошибке
        continue # Переход к следующей итерации цикла
        
    # Проверка, был ли забит гол (если shot != 1)
    if shot != 1: # Проверка, был ли забит гол (если shot != 1)
        print(f'GOAL!!! PLAYER {currentPlayer} WINS!!!') # Вывод сообщения о победе
        break # Завершение игры
    
    # Смена игрока: если был игрок 1, то теперь 2, и наоборот
    currentPlayer = 3 - currentPlayer # Смена игрока
    
"""
Объяснение кода:

1.  **Инициализация текущего игрока**:
    -   `currentPlayer: int = 1`: Устанавливает начальное значение переменной `currentPlayer` в 1, что означает, что первый игрок начинает игру.
        
2.  **Основной игровой цикл `while True:`**:
    -   Бесконечный цикл, который продолжается до тех пор, пока один из игроков не забьет гол (не будет выполнен оператор `break`).
        
3.  **Вывод сообщения о текущем игроке**:
    -   `print(f'PLAYER {currentPlayer} --- YOUR SHOT')`: Выводит сообщение, указывающее, чей сейчас ход.
        
4.  **Запрос ввода числа от игрока**:
    -  `try...except ValueError`: Блок try-except обрабатывает возможные ошибки ввода. Если пользователь введет не целое число, то будет выведено сообщение об ошибке и ошибка будет записана в лог.
    -   `shot: int = int(input('Введите число от 1 до 10: '))`: Запрашивает ввод числа от текущего игрока и преобразует введенную строку в целое число. Это число представляет собой попытку удара.
        
5.  **Проверка, был ли забит гол**:
    -   `if shot != 1:`: Проверяет, не равно ли введенное число 1. Если число не равно 1, это считается голом.
    -   `print(f'GOAL!!! PLAYER {currentPlayer} WINS!!!')`: Выводит сообщение о том, что игрок забил гол и выиграл игру.
    -   `break`: Завершает игровой цикл и игру.
        
6.  **Смена игрока**:
    -   `currentPlayer = 3 - currentPlayer`: Меняет текущего игрока на противоположного. Если `currentPlayer` был 1, то он станет 2, и наоборот.
        
"""
```