"""
HELLO:
=================
Сложность: 1
-----------------
Игра "HELLO" - это простая программа, которая выводит приветствие "HELLO". 
Это базовая программа для демонстрации вывода текста на экран.

Правила игры:
1.  Запуск программы выводит текст "HELLO" на экран.
2.  Программа завершается.
-----------------
Алгоритм:
1. Вывести на экран текст "HELLO".
2. Конец программы.
-----------------
Блок-схема:
```mermaid
flowchart TD
    Start["Начало"] --> OutputMessage["Вывод сообщения: <code><b>HELLO</b></code>"]
    OutputMessage --> End["Конец"]
```
    
Legenda:
    Start - Начало программы.
    OutputMessage - Вывод сообщения "HELLO" на экран.
    End - Конец программы.
"""
__author__ = 'hypo69 (hypo69@davidka.net)'

# Выводим сообщение "HELLO" на экран
print("HELLO")

"""
Пояснения:
1. `print("HELLO")`: Эта строка кода выводит текст "HELLO" на экран.
   - `print()`:  Это встроенная функция Python, которая выводит указанный текст на стандартное устройство вывода (обычно это экран).
   - `"HELLO"`: Это строковый литерал, который представляет собой текст, который нужно вывести.

Таким образом, вся программа состоит из одной строки кода, которая выводит приветствие "HELLO" на экран. Это самый простой пример программы на Python.
"""
```