# Инструкции для генерации документации к коду

## Обзор

Этот документ описывает, как генерировать Markdown-документацию для Python-кода, следуя определенным правилам и структуре.  Документация должна быть информативной и легко читаемой, помогая другим разработчикам понять и использовать код.

## Структура документации

Каждый документ должен начинаться с заголовка и краткого описания содержимого.  Следуйте структуре, показанной в примерах.  Используйте заголовки разного уровня для структурирования информации.  Обязательно включите оглавление.

### Оглавление

[Вставить оглавление с ссылками на все разделы]

## Инструкции по созданию документации

### Шаг 1: Анализ кода

Необходимо понять логику и действия, выполняемые данным фрагментом кода.  Обратите внимание на:

* **Цель**: Что пытается сделать код?
* **Входные данные**: Какие данные принимает код?
* **Выходные данные**: Какие данные код возвращает?
* **Логика**: Каким образом код обрабатывает данные?
* **Возможные ошибки**: Какие исключения могут возникать при выполнении кода?

### Шаг 2: Создание пошаговой инструкции

Создайте подробную инструкцию по использованию кода, включая:

* **Описание**: Объясните, что делает данный блок кода.  Будьте конкретны и избегайте расплывчатых формулировок.
* **Шаги выполнения**: Опишите последовательность действий в коде.  Будьте точны и последовательны.
* **Пример использования**: Приведите пример кода, как использовать данный фрагмент в проекте, включая входные данные и ожидаемые результаты.  Обязательно продемонстрируйте вызов функций и обработку результатов.

### Шаг 3: Форматирование документации

Используйте формат `reStructuredText (RST)` для структурирования документации.  Примеры показаны в исходных данных.  Обязательно используйте `.. code-block:: python` для вставки кода.

```rst
Как использовать этот блок кода
=========================================================================================

Описание
-------------------------
[Объяснение, что делает код. Например, эта функция вычисляет сумму двух чисел.]

Шаги выполнения
-------------------------
1. [Код принимает два числа в качестве аргументов.]
2. [Код суммирует эти числа.]
3. [Код возвращает результат сложения.]

Пример использования
-------------------------
.. code-block:: python

    def sum_numbers(a, b):
        return a + b

    result = sum_numbers(5, 3)
    print(result)  # Вывод: 8
```

### Шаг 4: Избегайте расплывчатых терминов

Избегайте расплывчатых терминов, таких как "получаем" или "делаем".  Будьте конкретны и используйте точные глаголы, описывающие действие кода.  Например: "вычисляет", "валидирует", "отправляет".


## Примеры (если есть доступные примеры кода, вставьте их здесь)

[Добавьте примеры Python-кода с соответствующей Markdown-документацией]
```