# Модуль GPROChat

## Обзор

Модуль `GPROChat` предназначен для взаимодействия с сервисом gprochat.com для генерации текста на основе предоставленных сообщений. Он реализует асинхронный генератор, который позволяет получать ответы от модели чата по частям, что полезно для обработки больших объемов текста. Модуль поддерживает использование прокси и сохранение истории сообщений.

## Подробнее

Модуль `GPROChat` предоставляет класс `GPROChat`, который наследуется от `AsyncGeneratorProvider` и `ProviderModelMixin`. Он использует `aiohttp` для выполнения асинхронных HTTP-запросов к API gprochat.com. Для обеспечения безопасности запросов модуль генерирует цифровую подпись на основе временной метки, сообщения и секретного ключа. Класс поддерживает потоковую передачу данных, что позволяет клиентам получать ответы по мере их генерации.

## Классы

### `GPROChat`

**Описание**: Класс `GPROChat` предоставляет функциональность для взаимодействия с API gprochat.com. Он позволяет генерировать текст на основе предоставленных сообщений, используя асинхронный генератор.

**Наследует**:
- `AsyncGeneratorProvider`: Обеспечивает базовую функциональность для асинхронных генераторов.
- `ProviderModelMixin`: Предоставляет методы для работы с моделями, специфичными для провайдера.

**Атрибуты**:
- `url` (str): URL сервиса gprochat.com.
- `api_endpoint` (str): URL API для генерации текста.
- `working` (bool): Указывает, работает ли сервис (в данном случае `False`).
- `supports_stream` (bool): Указывает, поддерживает ли сервис потоковую передачу данных (`True`).
- `supports_message_history` (bool): Указывает, поддерживает ли сервис историю сообщений (`True`).
- `default_model` (str): Модель, используемая по умолчанию (`gemini-1.5-pro`).

**Методы**:
- `generate_signature(timestamp: int, message: str) -> str`: Генерирует цифровую подпись для запроса.
- `create_async_generator(model: str, messages: Messages, proxy: str = None, **kwargs) -> AsyncResult`: Создает асинхронный генератор для получения текста от API.

## Функции

### `generate_signature`

```python
    @staticmethod
    def generate_signature(timestamp: int, message: str) -> str:
        """Генерирует цифровую подпись для запроса.

        Args:
            timestamp (int): Временная метка в миллисекундах.
            message (str): Сообщение для подписи.

        Returns:
            str: Сгенерированная цифровая подпись.
        """
        ...
```

**Назначение**: Функция `generate_signature` генерирует цифровую подпись, используя алгоритм SHA256. Подпись используется для обеспечения безопасности запросов к API.

**Параметры**:
- `timestamp` (int): Временная метка в миллисекундах.
- `message` (str): Сообщение, которое необходимо подписать.

**Возвращает**:
- `str`: Цифровая подпись в виде шестнадцатеричной строки.

**Как работает функция**:
1. Функция принимает временную метку и сообщение.
2. Определяет секретный ключ.
3. Формирует строку для хеширования, объединяя временную метку, сообщение и секретный ключ через двоеточие.
4. Вычисляет SHA256 хеш от полученной строки в кодировке UTF-8.
5. Возвращает хеш в шестнадцатеричном формате.

```text
Входные данные (timestamp, message)
    ↓
Формирование строки для хеширования (timestamp:message:secret_key)
    ↓
Вычисление SHA256 хеша
    ↓
Преобразование хеша в шестнадцатеричный формат
    ↓
Возврат подписи
```

**Примеры**:
```python
timestamp = int(time.time() * 1000)
message = "Hello, world!"
signature = GPROChat.generate_signature(timestamp, message)
print(f"Signature: {signature}")
```

### `create_async_generator`

```python
    @classmethod
    async def create_async_generator(
        cls,
        model: str,
        messages: Messages,
        proxy: str = None,
        **kwargs
    ) -> AsyncResult:
        """Создает асинхронный генератор для получения текста от API.

        Args:
            model (str): Модель для использования.
            messages (Messages): Список сообщений для отправки.
            proxy (str, optional): URL прокси-сервера. По умолчанию `None`.
            **kwargs: Дополнительные аргументы.

        Returns:
            AsyncResult: Асинхронный генератор для получения текста.
        """
        ...
```

**Назначение**: Функция `create_async_generator` создает асинхронный генератор, который отправляет запросы к API gprochat.com и возвращает текст по частям.

**Параметры**:
- `model` (str): Модель, используемая для генерации текста.
- `messages` (Messages): Список сообщений, отправляемых в API.
- `proxy` (str, optional): URL прокси-сервера. По умолчанию `None`.
- `**kwargs`: Дополнительные аргументы.

**Возвращает**:
- `AsyncResult`: Асинхронный генератор, который выдает текст по частям.

**Как работает функция**:
1. Функция принимает модель, список сообщений и опциональный прокси-сервер.
2. Извлекает модель, используемую по умолчанию.
3. Генерирует временную метку.
4. Форматирует сообщения в строку.
5. Генерирует цифровую подпись для запроса.
6. Формирует заголовки запроса, включая `accept`, `origin`, `referer`, `user-agent` и `content-type`.
7. Формирует данные запроса в формате JSON, включая сообщения, временную метку, пароль (в данном случае `None`) и подпись.
8. Отправляет асинхронный POST-запрос к API gprochat.com с использованием `aiohttp.ClientSession`.
9. Итерируется по частям ответа и декодирует их, выдавая в виде строк.

```text
Входные данные (model, messages, proxy)
    ↓
Получение модели
    ↓
Генерация временной метки
    ↓
Форматирование сообщений
    ↓
Генерация подписи
    ↓
Формирование заголовков запроса
    ↓
Формирование данных запроса (JSON)
    ↓
Отправка асинхронного POST-запроса к API
    ↓
Итерация по частям ответа и декодирование
    ↓
Выдача текста по частям (генератор)
```

**Примеры**:
```python
async def main():
    messages = [{"role": "user", "content": "Hello, world!"}]
    async for chunk in GPROChat.create_async_generator(model="gemini-1.5-pro", messages=messages):
        print(chunk, end="")

if __name__ == "__main__":
    import asyncio
    asyncio.run(main())