"""
<HELLO>:
=================
Сложность: 1
-----------------
Игра "HELLO" - это простая программа, которая выводит приветствие на экран. Она демонстрирует базовую операцию вывода текста.
Правила игры: Игры как таковой нет, программа просто выводит на экран строку "HELLO".
-----------------
Алгоритм:
1. Вывести на экран строку "HELLO".
-----------------
Блок-схема:
```mermaid
graph TD
    Start(Начало) --> Output(Вывод "HELLO");
    Output --> End(Конец);
```
"""
# Выводим на экран приветствие
print("HELLO")

"""
Пояснения:
1. `print("HELLO")`: Это единственная строка кода в программе. 
   - Функция `print()` используется для вывода текста на экран.
   - В данном случае, текст "HELLO" является аргументом функции `print()`, который будет выведен на консоль.
   - Эта программа демонстрирует самый простой пример вывода текста на экран.
licence:MIT(../licence)
"""
__author__ = 'hypo69 (hypo69@davidka.net)'
```