# Анализ кода модуля queen.py

**Качество кода**
8
- Плюсы
    - Код хорошо структурирован и логически понятен.
    - Используются функции для разделения логики (вывод доски, проверка хода, ввод хода).
    - Присутствуют подробные комментарии, объясняющие работу каждой части кода.
    - Игра функционирует согласно заданным правилам.

- Минусы
    - Отсутствует импорт необходимых библиотек, хотя в данном коде они не требуются.
    - Используются стандартные блоки try-except без логирования ошибок.
    - Имена переменных не соответствуют общепринятым стандартам (например, `player1_x` вместо `player_1_x`).
    - Комментарии не соответствуют формату reStructuredText (RST).

**Рекомендации по улучшению**

1.  **Добавить импорты:** Хотя в данном коде не используются внешние библиотеки, рекомендуется добавить импорт `sys` в начале файла.
2.  **Использовать `j_loads`:** В данном коде не требуется чтение файлов, поэтому использование `j_loads` не требуется.
3.  **Форматирование комментариев**: Все комментарии переписать в формате reStructuredText (RST).
4.  **Логирование ошибок:** Заменить блоки `try-except` на логирование ошибок с помощью `logger.error`.
5.  **Улучшить имена переменных:** Использовать `player_1_x` вместо `player1_x` и так далее.
6.  **Добавить документацию:** Добавить docstring к модулю, функциям и методам.
7.  **Улучшить читаемость кода:** Разбить длинные строки кода на несколько, для улучшения читаемости.

**Оптимизированный код**

```python
"""
Модуль реализует игру "Ферзь" для двух игроков на шахматной доске 8x8.
=====================================================================

Игра заключается в том, что два игрока по очереди перемещают своих ферзей
по горизонтали, вертикали или диагонали на любое количество клеток.
Цель игры - первым достичь противоположного края доски.

Правила игры:
    1. Два игрока управляют ферзями на шахматной доске 8x8.
    2. Каждый игрок начинает игру со своим ферзем на одном из противоположных краев доски.
    3. Игроки по очереди перемещают своих ферзей.
    4. Ферзь может перемещаться по горизонтали, вертикали или диагонали на любое количество клеток.
    5. Цель игры - первым достичь противоположного края доски.
    6. Игра завершается, когда один из ферзей достигает противоположного края.

Пример использования
--------------------

.. code-block:: python

    # Пример запуска игры
    import sys
    ...
    # Код игры
"""
import sys
from src.logger.logger import logger

# Инициализация начальных позиций ферзей
player_1_x = 0
player_1_y = 3
player_2_x = 7
player_2_y = 3


def print_board(player_1_x: int, player_1_y: int, player_2_x: int, player_2_y: int) -> None:
    """
    Выводит на экран шахматную доску с указанием текущих позиций ферзей.

    :param player_1_x: Координата X первого игрока.
    :param player_1_y: Координата Y первого игрока.
    :param player_2_x: Координата X второго игрока.
    :param player_2_y: Координата Y второго игрока.
    :return: None
    """
    print("   0  1  2  3  4  5  6  7")
    for row in range(8):
        row_str = str(row) + " "
        for col in range(8):
            if row == player_1_y and col == player_1_x:
                row_str += " 1 "
            elif row == player_2_y and col == player_2_x:
                row_str += " 2 "
            else:
                row_str += " . "
        print(row_str)


def is_valid_move(current_x: int, current_y: int, next_x: int, next_y: int) -> bool:
    """
    Проверяет, является ли ход ферзя допустимым.

    Ход допустим, если ферзь двигается по горизонтали, вертикали или диагонали.

    :param current_x: Текущая координата X ферзя.
    :param current_y: Текущая координата Y ферзя.
    :param next_x: Следующая координата X ферзя.
    :param next_y: Следующая координата Y ферзя.
    :return: True, если ход допустим, False в противном случае.
    """
    if next_x < 0 or next_x > 7 or next_y < 0 or next_y > 7:
        return False  # Проверка выхода за границы доски

    if current_x == next_x:  # Вертикальное перемещение
        return True
    elif current_y == next_y:  # Горизонтальное перемещение
        return True
    elif abs(current_x - next_x) == abs(current_y - next_y):  # Диагональное перемещение
        return True
    else:
        return False


def get_player_move(player_number: int, current_x: int, current_y: int) -> tuple[int, int]:
    """
    Запрашивает у игрока ввод координат для перемещения ферзя.
    Проверяет допустимость введенных координат.
    Возвращает новые координаты.

    :param player_number: Номер игрока (1 или 2).
    :param current_x: Текущая координата X ферзя.
    :param current_y: Текущая координата Y ферзя.
    :return: Кортеж (next_x, next_y) - новые координаты ферзя.
    """
    while True:
        try:
            move_str = input(f"Игрок {player_number}, введите ход (x, y): ")
            next_x, next_y = map(int, move_str.split(','))
            if is_valid_move(current_x, current_y, next_x, next_y):
                return next_x, next_y
            else:
                print("Недопустимый ход. Попробуйте еще раз.")
        except ValueError as ex:
            logger.error("Неверный формат ввода.", ex)
            print("Неверный формат ввода. Введите два числа через запятую, например: 1,2")

# Основной игровой цикл
while True:
    # Выводим доску
    print_board(player_1_x, player_1_y, player_2_x, player_2_y)
    # Ход игрока 1
    print("Ход игрока 1:")
    next_player_1_x, next_player_1_y = get_player_move(1, player_1_x, player_1_y)
    player_1_x, player_1_y = next_player_1_x, next_player_1_y

    if player_1_x == 7:  # Проверка на победу
        print("Игрок 1 победил!")
        break  # Завершаем цикл
    # Ход игрока 2
    print_board(player_1_x, player_1_y, player_2_x, player_2_y)
    print("Ход игрока 2:")
    next_player_2_x, next_player_2_y = get_player_move(2, player_2_x, player_2_y)
    player_2_x, player_2_y = next_player_2_x, next_player_2_y

    if player_2_x == 0:  # Проверка на победу
        print("Игрок 2 победил!")
        break  # Завершаем цикл
```