# Анализ кода модуля `footbl.py`

**Качество кода**
8
-  Плюсы
    - Код хорошо структурирован и легко читается.
    - Присутствуют docstring, описывающий назначение модуля, правила игры, алгоритм, блок схему и  пояснения к коду.
    - Код содержит обработку исключения `ValueError`, что предотвращает сбои при некорректном вводе данных.
-  Минусы
    - Отсутствует логирование.
    - Код не соответствует стандарту оформления docstring в Python, а также не использует RST.
    - Не используется `j_loads` или `j_loads_ns`.

**Рекомендации по улучшению**
1. Добавить логирование для отслеживания ошибок.
2. Использовать `j_loads` или `j_loads_ns` из `src.utils.jjson` для чтения файлов (не применимо в данном случае, так как нет чтения из файла).
3. Переписать docstring в формате RST.
4. Переписать комментарии в формате RST.
5. Использовать одинарные кавычки (`'`) в коде.

**Оптимизированный код**
```python
"""
Модуль для текстовой игры "Футбол"
=========================================================================================

Этот модуль реализует игру "Футбол", в которой два игрока по очереди вводят числа,
представляющие собой попытки ударов по воротам. Игра продолжается до тех пор, пока не будет забит гол.

Правила игры:
    1. Два игрока вводят по очереди числа от 1 до 10.
    2. Число "1" означает промах, любое другое число - гол.
    3. Игра заканчивается, когда один из игроков забивает гол.

Алгоритм:
    1. Инициализировать номер игрока, начать с первого игрока (1).
    2. Начать игровой цикл, пока не будет забит гол.
    3. Вывести сообщение "PLAYER" +  номер игрока +  "---YOUR SHOT".
    4. Запросить у игрока ввести число (попытку удара).
    5. Если введенное число равно 1, то перейти к шагу 7.
    6. Вывести сообщение "GOAL !!! PLAYER" + номер игрока + "WINS !!!".
    7. Изменить номер игрока на противоположного.
    8. Вернуться к шагу 3.

Блок-схема:
    .. mermaid::
       flowchart TD
           Start["Начало"] --> InitializePlayer["Инициализация: <code>currentPlayer = 1</code>"]
           InitializePlayer --> GameLoopStart{"Начало цикла: пока не забит гол"}
           GameLoopStart --> OutputPlayerTurn["Вывод сообщения: <code>\'PLAYER \' + currentPlayer + \' - YOUR SHOT\'</code>"]
           OutputPlayerTurn --> InputShot["Ввод числа пользователем: <code>shot</code>"]
           InputShot --> CheckGoal{"Проверка: <code>shot == 1?</code>"}
           CheckGoal -- Нет --> OutputWin["Вывод сообщения: <code>\'GOAL!!! PLAYER \' + currentPlayer + \' WINS!!!\'</code>"]
           OutputWin --> End["Конец"]
           CheckGoal -- Да --> SwitchPlayer["<code>currentPlayer = 3 - currentPlayer</code>"]
           SwitchPlayer --> GameLoopStart
           GameLoopStart -- Нет --> End

    
    *   Start - Начало игры.
    *   InitializePlayer - Инициализация переменной currentPlayer значением 1.
    *   GameLoopStart - Начало цикла игры.
    *   OutputPlayerTurn - Вывод сообщения о ходе текущего игрока.
    *   InputShot - Запрос ввода числа от игрока.
    *   CheckGoal - Проверка, является ли введенное число 1.
    *   OutputWin - Вывод сообщения о победе игрока.
    *   End - Конец игры.
    *   SwitchPlayer - Переключение хода на другого игрока.

:author: hypo69 (hypo69@davidka.net)
"""
from src.logger.logger import logger #  Импортируем logger

# Инициализация текущего игрока (начинает игрок 1)
currentPlayer = 1

# Основной игровой цикл
while True:
    # Вывод сообщения о ходе текущего игрока
    print(f'PLAYER {currentPlayer} --- YOUR SHOT')

    # Запрос ввода числа от игрока
    try:
        shot = int(input('Введите число от 1 до 10: '))
    except ValueError as e:
        #  Логирование ошибки при некорректном вводе
        logger.error(f'Ошибка ввода: {e}')
        print('Пожалуйста, введите целое число.')
        continue

    # Проверка, был ли забит гол (если shot != 1)
    if shot != 1:
        print(f'GOAL!!! PLAYER {currentPlayer} WINS!!!')
        break # Завершение игры

    # Смена игрока: если был игрок 1, то теперь 2, и наоборот
    currentPlayer = 3 - currentPlayer

"""
Объяснение кода:
1.  **Инициализация текущего игрока**:
    -   `currentPlayer = 1`: Устанавливает начальное значение переменной `currentPlayer` в 1, что означает, что первый игрок начинает игру.

2.  **Основной игровой цикл `while True:`**:
    -   Бесконечный цикл, который продолжается до тех пор, пока один из игроков не забьет гол (не будет выполнен оператор `break`).

3.  **Вывод сообщения о текущем игроке**:
    -   `print(f'PLAYER {currentPlayer} --- YOUR SHOT')`: Выводит сообщение, указывающее, чей сейчас ход.

4.  **Запрос ввода числа от игрока**:
    - `try...except ValueError`: Блок try-except обрабатывает возможные ошибки ввода. Если пользователь введет не целое число, то будет выведено сообщение об ошибке и ошибка будет записана в лог.
    -   `shot = int(input('Введите число от 1 до 10: '))`: Запрашивает ввод числа от текущего игрока и преобразует введенную строку в целое число. Это число представляет собой попытку удара.

5.  **Проверка, был ли забит гол**:
    -   `if shot != 1:`: Проверяет, не равно ли введенное число 1. Если число не равно 1, это считается голом.
    -   `print(f'GOAL!!! PLAYER {currentPlayer} WINS!!!')`: Выводит сообщение о том, что игрок забил гол и выиграл игру.
    -   `break`: Завершает игровой цикл и игру.

6.  **Смена игрока**:
    -   `currentPlayer = 3 - currentPlayer`: Меняет текущего игрока на противоположного. Если `currentPlayer` был 1, то он станет 2, и наоборот.

"""
```